In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
#Pandas added the series where the indexes matched, but not where ser1 didnt have
#Null value automatically placed when there is no matched index!
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [5]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [7]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])

dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [8]:
#Only successfully added matching row and column index rest filled w/null values
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [11]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [10]:
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

NOTE: REALLY Important tool (SET fill_value equal to 0, and it will use the original values of the dataframe unless there isnt a value)
If youre trying to add different sized dataframes but don't want to lose any data to null values!

In [12]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [13]:
ser3 = dframe2.iloc[0]

In [14]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [15]:
#Can subtract this series perfectly b/c it matches perfectly w the columns
dframe2 - ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6